#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.tf_repository["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
module.svc_repository["storage"].data.github_team.owner: Reading...
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
github_repository.svc_template_python: Refreshing state... [id=svc-template-python]
github_repository.svc_template_rust: Refreshing state... [id=svc-template-rust]
module.tf_repository["github"].github_repository.repository: Refreshing state... [id=tf-github]
github_repository.svc_template_typescript: Refreshing state... [id=svc-template-typescript]
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
module.tf_repository["onboarding"].data.github_team.owner: Reading...
module.tf_repository["github"].data.github_team.owner: Reading...
module.repository["website"].data.github_team.owner: Reading...
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Reading...
github_team_repository.svc_template_typescript_maintainer: Refreshing state... [id=6311795:svc-template-typescript]
github_repository_file.svc_template_typescript_sdd: Refreshing state... [id=svc-template-typescript/docs/sdd.md]
github_repository_file.svc_template_python_sdd: Refreshing state... [id=svc-template-python/docs/sdd.md]
github_team_repository.svc_template_python_maintainer: Refreshing state... [id=6311795:svc-template-python]
module.svc_repository["storage"].data.github_team.owner: Read complete after 3s [id=6311795]
github_repository_file.svc_template_rust_sdd: Refreshing state... [id=svc-template-rust/docs/sdd.md]
github_team_repository.svc_template_rust_maintainer: Refreshing state... [id=6311795:svc-template-rust]
module.svc_repository["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
module.tf_repository["onboarding"].data.github_team.owner: Read complete after 5s [id=6029505]
module.tf_repository["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.tf_repository["github"].data.github_team.owner: Read complete after 5s [id=6311795]
module.tf_repository["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.repository["website"].data.github_team.owner: Read complete after 5s [id=5490296]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository["cla-bot"].data.github_team.owner: Read complete after 4s [id=6029505]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository["clabot-config"].data.github_team.owner: Read complete after 5s [id=6029505]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["tools"].data.github_team.owner: Read complete after 5s [id=6203057]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.tf_repository["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.tf_repository["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.tf_repository["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.svc_repository["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.svc_repository["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.svc_repository["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.tf_repository["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.tf_repository["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.svc_repository["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.tf_repository["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.tf_repository["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.svc_repository["storage"].github_branch_protection.all["svc-storage"]: Refreshing state... [id=BPR_kwDOHn-Ji84BpnDy]
module.svc_repository["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHn-Ji84BpLXK]
module.svc_repository["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Ji84BmmRg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.lib_template_rust will be created
  + resource "github_repository" "lib_template_rust" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Arrow (Rust) Library Repository"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = true
      + name                   = "template-rust-lib"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # github_repository_file.lib_template_rust_sdd will be created
  + resource "github_repository_file" "lib_template_rust_sdd" {
      + branch              = "main"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ![Arrow Banner](https://github.com/Arrow-air/.github/raw/main/profile/assets/arrow_v2_twitter-banner_neu.png)
            
            # \<MODULE NAME\> - Software Design Document (SDD)
            
            ## Overview
            
            This document details the software implementation of FIXME.
            
            This process is responsible for FIXME
            
            Attribute | Description
            --- | ---
            Status | Draft
            
            ## Related Documents
            
            Document | Description
            --- | ---
            [Concept of Operations (CONOPS) (FIXME)](./FIXME) | Overview of the scope and duties of this module.
            [Requirements & User Stories (FIXME)](./FIXME) | Requirements and user stories for this module.
            
            ## Location
            
            FIXME
            
            ## Module Attributes
            
            Attribute | Applies | Explanation
            --- | --- | ---
            Safety Critical | ? | 
            Realtime | ? |
            
            ## Global Variables
            
            **Statically Allocated Queues**
            
            FIXME
            
            ## Logic 
            
            ### Initialization
            
            FIXME 
            
            ### Control Loop
            
            FIXME
            
            ### Cleanup
            
            FIXME
            
            ## Interfaces
            
            For a refresher of the processes in the Arrow backend, please see the [top level README.md](../README.md).
            
            ```mermaid
            graph LR
                subgraph Vehicle Domain
                    air((Aircraft))
                end
            
                subgraph Client Domain
                    app(App X)
                end
            
                subgraph Server Domain
                    module[Module A]
                end
            ```
            
            FIXME description of the graph.
            
            ## Tests
            
            FIXME
            
            ### Unit Tests
            
            FIXME
        EOT
      + file                = "docs/sdd.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "template-rust-lib"
      + sha                 = (known after apply)
    }

  # github_team_repository.lib_template_rust_maintainer will be created
  + resource "github_team_repository" "lib_template_rust_maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "template-rust-lib"
      + team_id    = "services"
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.svc_repository["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Ji84BpLXK"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.svc_repository["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Ji84BmmRg"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.tf_repository["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @ServiceDog, Action: `pull_request`*